### Aggregation and Grouping

First, we import the pandas library, which is essential for working with DataFrames.

In [1]:
import pandas as pd

We create a sample DataFrame with employee data, including their department, team, gender, salary, age, and join date. This will be used to demonstrate various aggregation and grouping techniques.

In [2]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

Let's display the initial DataFrame to see its structure and content.

In [3]:
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

This is a basic `groupby` operation. We group the DataFrame by the 'Department' column and then calculate the mean of the 'Salary' for each department.

In [4]:
df.groupby('Department')['Salary'].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

The `.agg()` method allows you to apply multiple aggregation functions at once. Here, we calculate the mean, minimum, and maximum salary for each department.

In [5]:
df.groupby('Department')['Salary'].agg(['mean','min','max'])

            mean  min  max
Department
HR          87.5   85   90
IT          81.5   78   85
Marketing   90.0   88   92
Sales       77.5   75   80

`transform` is a powerful function that performs a group operation but returns a result that is the same shape as the original DataFrame. Here, we calculate the average salary for each 'Team' and broadcast this value back to each row within the respective team.

In [6]:
df['avg_salary'] = df.groupby('Team')['Salary'].transform('mean')

Now, let's look at the DataFrame with the new `avg_salary` column. Each employee now has a column showing the average salary of their team.

In [7]:
df

  Department Team Gender  Salary  Age   JoinDate  avg_salary
0         HR    A      M      85   23 2020-01-10        87.5
1         HR    A      F      90   25 2020-02-15        87.5
2         IT    B      M      78   30 2021-03-20        81.5
3         IT    B      F      85   22 2021-04-10        81.5
4  Marketing    C      M      92   28 2020-05-30        90.0
5  Marketing    C      F      88   26 2020-06-25        90.0
6      Sales    D      M      75   21 2021-07-15        77.5
7      Sales    D      F      80   27 2021-08-01        77.5

The `.filter()` method lets you select or drop groups based on a condition. In this case, we are keeping only the departments where the average salary is greater than 85.

In [8]:
df.groupby('Department').filter(lambda x: x['Salary'].mean() > 85)

  Department Team Gender  Salary  Age   JoinDate  avg_salary
0         HR    A      M      85   23 2020-01-10        87.5
1         HR    A      F      90   25 2020-02-15        87.5
4  Marketing    C      M      92   28 2020-05-30        90.0
5  Marketing    C      F      88   26 2020-06-25        90.0